perf/scenarios/exchange.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-exchange"

  pool: 50

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 3
    - name: Plain
      duration: 60
      arrivalRate: 3

scenarios:
  - name: ARS to USD Exchange
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 100000

  - name: USD to ARS Exchange
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            baseAccountId: 2
            counterAccountId: 1
            baseAmount: 100

  - name: Rate Checks
    flow:
      - get:
          url: '/rates'

  - name: Account Monitoring
    flow:
      - get:
          url: '/accounts'